Python Data Analysis - Problem 1

In [3]:
import pandas as pd

In [4]:
 Cars = pd.read_csv('cars.csv')

b.) Display the first and last five rows of the resulting cars

the first method used was the .head and .tail but using this method it not only diplayed the car model but the rest of the rows. 
but in the problem it was specified that only the car model should be displayed

In the next iteration, the following function was used: Montales_Pandas.loc[[0,1,2,3,4,5],['Model']]
it displayed the results that was asked but the code was too long and can be further simplified

the last iteration of the code is the following: Montales_Pandas['Model'].head(5)
This was shorter and much simpler than the previous ones and also displayed the results that were asked for.

In [7]:
Cars['Model'].head(5)

0            Mazda RX4
1        Mazda RX4 Wag
2           Datsun 710
3       Hornet 4 Drive
4    Hornet Sportabout
Name: Model, dtype: object

In [8]:
Cars['Model'].tail(5)

27      Lotus Europa
28    Ford Pantera L
29      Ferrari Dino
30     Maserati Bora
31        Volvo 142E
Name: Model, dtype: object

In [9]:
Cars.loc[[0,1,2,3,4,5],['Model']]

               Model
0          Mazda RX4
1      Mazda RX4 Wag
2         Datsun 710
3     Hornet 4 Drive
4  Hornet Sportabout
5            Valiant

In [34]:
Cars.to_csv('Montales_Pandas-P1.py', index=False)

Problem 2:
a.>Display the first five rows with odd-numbered columns (columns 1, 3, 5, 7...) of cars.

In [12]:
Cars.iloc[:5,::2]

               Model  cyl   hp     wt  vs  gear
0          Mazda RX4    6  110  2.620   0     4
1      Mazda RX4 Wag    6  110  2.875   0     4
2         Datsun 710    4   93  2.320   1     4
3     Hornet 4 Drive    6  110  3.215   1     3
4  Hornet Sportabout    8  175  3.440   0     3

Display the row that contains the ‘Model’ of ‘Mazda RX4’

In [14]:
Cars.loc[Cars['Model']=='Mazda RX4', ['Model']]

       Model
0  Mazda RX4

How many cylinders (‘cyl’) does the car model ‘Camaro Z28’ have?

In [16]:
Cars.loc[Cars['Model']=='Camaro Z28', ['Model','cyl']]

         Model  cyl
23  Camaro Z28    8

Determine how many cylinders (‘cyl’) and what gear type (‘gear’) do the car models ‘Mazda RX4
Wag’, ‘Ford Pantera L’ and ‘Honda Civic’ have.

In [18]:
Cars.loc[Cars['Model'].isin(['Mazda RX4 Wag','Ford Pantera L','Honda Civic']), ['Model','cyl', 'gear']]

             Model  cyl  gear
1    Mazda RX4 Wag    6     4
18     Honda Civic    4     4
28  Ford Pantera L    8     5

In [19]:
Cars.to_csv('Montales_Pandas-P2.py', index=False)